
/*---------------------------------------------------------------------*/
/* --- STC MCU International Limited ----------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.GXWMCU.com --------------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了宏晶科技的资料及程序   */
/*---------------------------------------------------------------------*/


//#define MAIN_Fosc		22118400L	//定义主时钟

#include	"STC15Fxxxx.H"
#include	"UART1-2.H"

#define		Baudrate1	115200UL
#define		Baudrate2	115200UL



/*************	功能说明	**************m

双串口全双工中断方式收发通讯程序。

******************************************/




u8	TX1_Cnt;	//发送计数
u8	RX1_Cnt;	//接收计数
u8	TX2_Cnt;	//发送计数
u8	RX2_Cnt;	//接收计数
bit	B_TX1_Busy;	//发送忙标志
bit	B_TX2_Busy;	//发送忙标志
u8 	idata RX1_Buffer[UART1_BUF_LENGTH];	//接收缓冲
u8 	idata RX2_Buffer[UART2_BUF_LENGTH];	//接收缓冲





//========================================================================
// 函数: void PrintString1(u8 *puts)
// 描述: 串口1发送字符串函数。
// 参数: puts:  字符串指针.
// 备注: 
//========================================================================
void PrintString1(u8 *puts)
{
    for (; *puts != 0;	puts++)   	//遇到停止符0结束
	{
		SBUF = *puts;
		B_TX1_Busy = 1;
		while(B_TX1_Busy);
	}
}


//========================================================================
// 函数: void PrintD1(const char *str)
// 描述: 串口1发送字符串函数。
// 参数: puts:  字符串指针.
// 备注: 
//========================================================================
void PrintD1(const char *str)
{
char *s;
     
    for (s = (char *)str; *s; s++)
    {
				Printchar1(*s);
    }
   
}
//========================================================================
// 函数: void PrintN1(int num)
// 描述: 串口1发送数值函数。
// 参数: num:  数值.
// 备注: 范围-+99999
//========================================================================
void PrintN1(int num)
{
	
if(num >= 0){
	if(num < 100000)
		{
			if(num < 10)
				{
					Printchar1(num + 0x30);
				}
			if(num>=10 && num < 100)
				{
					Printchar1((num / 100) + 0x30);
					Printchar1((num % 100)/10 + 0x30);
				}
			if(num >= 100 && num < 1000)
				{
					Printchar1((num / 100) + 0x30);
					Printchar1((num % 100)/10 + 0x30);
					Printchar1((num % 100)%10 + 0x30);
				}
			if(num >= 1000 && num < 10000)
				{
					Printchar1((num / 1000) + 0x30);
					Printchar1((num % 1000)/100 + 0x30);
					Printchar1((num % 1000)%100/10 + 0x30);
					Printchar1((num % 1000)%100%10 + 0x30);
				}	
			if(num >= 10000 && num < 100000)
				{
				Printchar1((num / 10000) + 0x30);
					Printchar1((num % 10000)/1000 + 0x30);
					Printchar1((num % 10000)%1000/100 + 0x30);
					Printchar1((num % 10000)%1000%100/10 + 0x30);
					Printchar1((num % 10000)%1000%100%10 + 0x30);
			
				}

		}
	
}

if(num < 0){
	num = -num;
	
	Printchar1('-');
	
	if(num < 100000)
		{
			if(num < 10)
				{
					Printchar1(num + 0x30);
				}
			if(num>=10 && num < 100)
				{
					Printchar1((num / 100) + 0x30);
					Printchar1((num % 100)/10 + 0x30);
				}
			if(num >= 100 && num < 1000)
				{
					Printchar1((num / 100) + 0x30);
					Printchar1((num % 100)/10 + 0x30);
					Printchar1((num % 100)%10 + 0x30);
				}
			if(num >= 1000 && num < 10000)
				{
					Printchar1((num / 1000) + 0x30);
					Printchar1((num % 1000)/100 + 0x30);
					Printchar1((num % 1000)%100/10 + 0x30);
					Printchar1((num % 1000)%100%10 + 0x30);
				}	
			if(num >= 10000 && num < 100000)
				{
				Printchar1((num / 10000) + 0x30);
					Printchar1((num % 10000)/1000 + 0x30);
					Printchar1((num % 10000)%1000/100 + 0x30);
					Printchar1((num % 10000)%1000%100/10 + 0x30);
					Printchar1((num % 10000)%1000%100%10 + 0x30);
			
				}

		}
}

}


//========================================================================
// 函数: void Printchae1(char Data)
// 描述: 串口1发送字符函数。
// 参数: Data:  字符.
// 备注: 
//========================================================================
void Printchar1(char Data)
{

		SBUF = Data;
		B_TX1_Busy = 1;
		while(B_TX1_Busy);

}



//========================================================================
// 函数: void Printchar2(char Data)
// 描述: 串口2发送字符函数。
// 参数: Data:  字符.
// 备注: 
//========================================================================
void Printchar2(char Data)
{

		S2BUF = Data;
		B_TX2_Busy = 1;
		while(B_TX2_Busy);
	
}
//========================================================================
// 函数: void PrintString2(u8 *puts)
// 描述: 串口2发送字符串函数。
// 参数: puts:  字符串指针.
// 备注: 
//========================================================================
void PrintString2(u8 *puts)
{
    for (; *puts != 0;	puts++)   	//遇到停止符0结束
	{
		S2BUF = *puts;
		B_TX2_Busy = 1;
		while(B_TX2_Busy);
	}
}

//========================================================================
// 函数: SetTimer2Baudraye(u16 dat)
// 描述: 设置Timer2做波特率发生器。
// 参数: dat: Timer2的重装值.
// 备注: 
//========================================================================
void	SetTimer2Baudraye(u16 dat)
{
	AUXR &= ~(1<<4);	//Timer stop
	AUXR &= ~(1<<3);	//Timer2 set As Timer
	AUXR |=  (1<<2);	//Timer2 set as 1T mode
	T2H = dat / 256;
	T2L = dat % 256;
	IE2  &= ~(1<<2);	//禁止中断
	AUXR |=  (1<<4);	//Timer run enable
}

//========================================================================
// 函数: void	UART1_config(u8 brt)
// 描述: UART1初始化函数。
// 参数: brt: 选择波特率, 2: 使用Timer2做波特率, 其它值: 使用Timer1做波特率.
// 备注: 
//========================================================================
void	UART1_config(u8 brt)
{
	/*********** 波特率使用定时器2 *****************/
	if(brt == 2)
	{
		AUXR |= 0x01;		//S1 BRT Use Timer2;
		SetTimer2Baudraye(65536UL - (MAIN_Fosc / 4) / Baudrate1);
	}

	/*********** 波特率使用定时器1 *****************/
	else
	{
		TR1 = 0;
		AUXR &= ~0x01;		//S1 BRT Use Timer1;
		AUXR |=  (1<<6);	//Timer1 set as 1T mode
		TMOD &= ~(1<<6);	//Timer1 set As Timer
		TMOD &= ~0x30;		//Timer1_16bitAutoReload;
		TH1 = (u8)((65536UL - (MAIN_Fosc / 4) / Baudrate1) / 256);
		TL1 = (u8)((65536UL - (MAIN_Fosc / 4) / Baudrate1) % 256);
		ET1 = 0;	//禁止中断
		INT_CLKO &= ~0x02;	//不输出时钟
		TR1  = 1;
	}
	/*************************************************/

	SCON = (SCON & 0x3f) | 0x40;	//UART1模式, 0x00: 同步移位输出, 0x40: 8位数据,可变波特率, 0x80: 9位数据,固定波特率, 0xc0: 9位数据,可变波特率
//	PS  = 1;	//高优先级中断
	ES  = 1;	//允许中断
//	ES  = 0;  //不允许中断
	REN = 1;	//允许接收
	P_SW1 &= 0x3f;
	P_SW1 |= 0x00;		//UART1 switch to, 0x00: P3.0 P3.1, 0x40: P3.6 P3.7, 0x80: P1.6 P1.7 (必须使用内部时钟)
//	PCON2 |=  (1<<4);	//内部短路RXD与TXD, 做中继, ENABLE,DISABLE

	B_TX1_Busy = 0;
	TX1_Cnt = 0;
	RX1_Cnt = 0;
}


//========================================================================
// 函数: void	UART2_config(u8 brt)
// 描述: UART2初始化函数。
// 参数: brt: 选择波特率, 2: 使用Timer2做波特率, 其它值: 无效.
// 备注: 
//========================================================================
void	UART2_config(u8 brt)	// 选择波特率, 2: 使用Timer2做波特率, 其它值: 无效.
{
	if(brt == 2)
	{
		SetTimer2Baudraye(65536UL - (MAIN_Fosc / 4) / Baudrate2);

		S2CON &= ~(1<<7);	// 8位数据, 1位起始位, 1位停止位, 无校验
		IE2   |= 1;			//允许中断
		S2CON |= (1<<4);	//允许接收
		P_SW2 &= ~0x01;	
	  P_SW2 |= 0;			//UART2 switch to: 0: P1.0 P1.1,  1: P4.6 P4.7

		B_TX2_Busy = 0;
		TX2_Cnt = 0;
		RX2_Cnt = 0;
	}
}




